/**
 * Problème 1.
 * \file main.cpp
 * \author Mehdi Benouhoud & Laurent Bourgon
 * \date January 17, 2023
 *
 *
 * +--------------+----+--------------+-------+
 * | État présent | D2 | État suivant |   A   |
 * +--------------+----+--------------+-------+
 * |              |  0 |     INIT     |  OFF  |
 * |     INIT     +----+--------------+-------+
 * |              |  1 |      S1      |  OFF  |
 * +--------------+----+--------------+-------+
 * |              |  0 |      S1      |  OFF  |
 * |      S1      +----+--------------+-------+
 * |              |  1 |      S2      |  OFF  |
 * +--------------+----+--------------+-------+
 * |              |  0 |      S2      |  OFF  |
 * |      S2      +----+--------------+-------+
 * |              |  1 |      S3      |  OFF  |
 * +--------------+----+--------------+-------+
 * |      S3      |  X |     INIT     | GREEN |
 * +--------------+----+--------------+-------+
 */

#include <avr/io.h>
#include <util/delay.h>

enum class Color : uint8_t
{
    OFF,
    RED,
    GREEN
};

int main()
{

    return 0;
}